Revit 2024 API
PipeFittingAndAccessoryPressureDropUIDataItem Members
The PipeFittingAndAccessoryPressureDropUIDataItem type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the PipeFittingAndAccessoryPressureDropUIDataItem
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetEntity
 Returns the entity set by UI server. or an invalid entity otherwise.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetPipeFittingAndAccessoryData
 Gets the fitting data stored in the UI data item.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
SetEntity
 Stores the entity in the UI data item.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
PipeFittingAndAccessoryPressureDropUIDataItem Class
Autodesk.Revit.UI.Plumbing Namespace